#include "S3.h"
#include<stdio.h>
/**
 * @brief C语言运算符优先级示范
 * 注：优先级总结：
 * 1、初等运算符：()  []  ->  .
 * 2、单目运算符：! ~ ++ -- - (类型) * & sizeof  注：这里*表示指针
 * 3、双目或三目运算符：算术运算符>移位运算符>关系运算符>逻辑运算符>条件运算符>赋值运算符>逗号运算符
 *   算术运算符：× / + -   移位运算符:>> << 关系运算符:< <= > >= == != 逻辑运算符:& ^ | && || 条件运算符: ?: 赋值运算符:= += -= *= /= %= >>= <<= &= ^= |=  
 * 优先级相同时：运算次序有结合方向决定，自右向左的结合方向的运算符：单目运算符，条件运算符，赋值运算符
 * @return priority 
 */
void S2_operatorpriority()
{   
    /**
     * @brief 优先级中++i 与i++表达式的区分实例
     * 注：p++表达式的值为p的值，++p表达式的值为p+1的值。两个表达式运行后，p均进行了+1运算
     * 
     */
    {
        char charArray[]={'H','e','l','l','o','w'};
        char *p=charArray;
        printf("*p++=%c\n",*p++);  //输出：*p++=H
        p--;
        printf("*++p=%c\n",*++p);  //输出：*++p=e
    }
    /**
     * @brief 运算符举例
     * 注：!a||++b&&a--相当于c=(!a)||(++b)&&(a--),先计算右边的值，再赋值，!a=1,或运算结果必定为1,||右边的运算不执行，所以，b=2，c=1
     */
    {
        int a=0,b=2,c;
        c=!a||++b&&a--;
        printf("a=%d,b=%d,c=%d\n",a,b,c); //输出a=0,b=2,c=1
    }

}
/**
 * @brief 主要分析C语言中的字符型数据、赋值表达式以及输入输出数据格式
 * 
 */
void S2_basic()
{
    /**
     * @brief 字符型数据分析
     * 注：字符型数据被认为是整形数据的一部分，占有0～127,字符型存储空间中储存的是字符变量对应的ASCII码值
     */
    {
        char chartest='a';
        printf("%%d输出为%d,%%c输出为%c\n",chartest,chartest);
    }
    /**
     * @brief 赋值表达式
     * 注:赋值表达式  变量=表达式   等号左边的称为左值，左值应是可变化的，等号右边的称为右值，右值没有要求
     * 赋值表达式的值等于赋值后左侧变量的值 
     * 
     */
    {
       int a,b,c;
       a=(b=4)+(c=6);
       printf("a=%d,b=%d,c=%d\n",a,b,c); //a=10,b=4,c=6
    }
    /**
     * @brief 输入输出数据格式分析
     * 注：scanf的输入应是原样输入  对scanf("c=%d,d=%d",&c,&d);应输入c=3,d=4
     * 数值输入(整形，浮点型数值),若输入空格、回车、Tab或字符等不属于数值的字符，则认为该数值输入结束
     * 字符输入，系统会自动获取一个字符，字符输入与数值输入一起时，不需要使用空格区分开，系统会自动区分 例：scanf("%d%c%f",&e,&f,&g);应该输入42a12.34而不是42 a 12.34
     */
    {
       int a,b,c,d;
       scanf("%d,%d",&a,&b);
       scanf("c=%d,d=%d",&c,&d);  //输入1,2c=3,d=4
       printf("a=%d,b=%d,c=%d,d=%d\r\n",a,b,c,d);//输出a=1,b=2,c=3,d=4
       int e;
       char f;
       float g;
       scanf("%d%c%f",&e,&f,&g);  //输入 42a12.34
       printf("e=%4d,f=%c,g=%5.2f\n",e,f,g);//输出 e=  42,f=a,g=12.34
    }
}

